Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/mobility-omegat.tmx
Source language: en_us
Languages: pt_br

source: Specify URL of running service
pt_br: Especificar URL de serviço de execução

source: Specify path to WSDL file
pt_br: Especificar caminho para arquivo WSDL

source: {0} is not compliant with Java ME Web Services specification (JSR-172).
pt_br: {0} não está compatível com especificação de serviços web Java ME (JSR-172).

source: Proxy Settings
pt_br: Configurações de proxy

source: Proxy &Host:
pt_br: Servidor pro&xy:

source: &Port:
pt_br: &Porta:

source: Proxy server hostname or IP
pt_br: Nome da máquina de servidor de proxy ou IP

source: Specify hostname or IP of proxy server
pt_br: Especificar nome da máquina ou IP do servidor de of proxy

source: Proxy server port number
pt_br: Número da porta do servidor de proxy

source: Specify port number of proxy server
pt_br: Especificar número da porta do servidor de proxy

source: If proxy host is not specified, proxy port should not be specified either.
pt_br: Se máquina do proxy não for especificada, a porta do proxy não deverá ser especificada também.

source: Proxy server URL is malformed: {0}
pt_br: Servidor de proxy URL está mal formada: {0}

source: Now specify the port that this proxy host is running on.
pt_br: Agora especifique a porta da máquina onde este proxy está em execução.

source: Proxy port cannot be negative.
pt_br: Porta do proxy não pode ser negativa.

source: Proxy port cannot be greater than {0}.
pt_br: Porta do proxy não pode ser maior que {0}.

source: ''{0}'' is not a valid integer.
pt_br: ''{0}'' não é um inteiro válido.

source: Ready.
pt_br: Pronto.

source: Connecting...
pt_br: Conectando...

source: Downloading...
pt_br: Baixando...

source: Complete
pt_br: Completo

source: Terminated.
pt_br: Finalizado.

source: Response from this URL is not a valid WSDL file.
pt_br: A resposta deste URL não é um arquivo WSDL válido.

source: Connection exception
pt_br: Exceção da conexão

source: Badly formed URL
pt_br: URL mal formada

source: I/O exception
pt_br: exceção de I/O

source: You are trying to access secure site.
pt_br: Voce está tentando acessar site seguro.

source: Do you want to continue?
pt_br: Voce quer continuar?

source: Secure access is not allowed.
pt_br: Acesso seguro não permitido.

source: Java ME Web Service Client Information
pt_br: Informação de cliente de serviço web Java ME

source: Running Web &Service
pt_br: Executando &Serviço web

source: Retrieve &WSDL
pt_br: Recuperar &WSDL

source: &Proxy Settings...
pt_br: Configurações de &proxy...

source: Specify the local filename for the retrieved WSDL.
pt_br: Especificar o local do nome do arquivo para WSDL recuperado.

source: WSDL &URL:
pt_br: &URL do WSDL:

source: &Local Filename:
pt_br: Nome do arquivo &local:

source: &Existing WSDL File
pt_br: Arquivo WSDL &existente

source: WSDL Filena&me:
pt_br: No&me do arquivo:

source: Pr&oject:
pt_br: Pr&ojeto:

source: P&ackage:
pt_br: P&acote:

source: &Client Name:
pt_br: Nome do &cliente:

source: Enter the URL of the service you wish to use.
pt_br: Indique a URL do serviço que deseja utilizar.

source: Click Retrieve WSDL to download the WSDL file for this service.
pt_br: Clique recuperar WSDL para baixar o arquivo WSDL deste serviço.

source: Download in progress.
pt_br: Download em execução.

source: Download failed for unknown reason.
pt_br: Baixa falhou por razões desconhecidas.

source: Enter the name of the WSDL file representing the service you wish to use.
pt_br: Indique o nome do arquivo WSDL representante do serviço que deseja utilizar.

source: WSDL file is invalid.
pt_br: Arquivo WSDL é válido.

source: WSDL file does not contain port information.
pt_br: Arquivo WSDL não contem informação da porta.

source: Enter the Java package where the service interfaces should be generated.
pt_br: Indique o pacote Java onde a interface do serviço deve ser gerada.

source: Package name is invalid.
pt_br: Nome do pacote é válido.

source: Generate &DataBinding structures
pt_br: Gerar estrutura &dataBinding

source: Web Service Descriptor Files (*.wsdl)
pt_br: Arquivos descritor de serviço web (*.wsdl)

source: URL of Running Service
pt_br: URL de serviço de execução

source: Filename of WSDL file
pt_br: Nome do arquivo do WSDL

source: Clietn Name
pt_br: Nome do cliente

source: Specify client name
pt_br: Especificar nome do cliente

source: The name is not valid Java identifier.
pt_br: O nome não é um identificador Java válido.

source: Insert valid Client name.
pt_br: Inserir nome do cliente válido.

source: <html><b>Web Service is not WS-I compliant as required by Java ME Web Services specification!</b></html> Reasons: {0} <html>Use <b>Mobile Client to Web Application</b> for approaching non WS-I compliant web services through web application.</html>
pt_br: <html><b>Serviço web WS-I não é compatível como exigida pela especificação de Seviçoes web Java ME!</b></html> Reasons: {0} <html>Use <b>Mobile Client to Web Application</b> for approaching non WS-I compliant web services through web application.</html>

source: Validation results:
pt_br: Resultados da validação:

source: List of validation results
pt_br: Lista de resultados de validação

source: Client Type:
pt_br: Tipo de cliente:

source: Specify the package where the web service client interfaces (and stubs, if applicable) will be generated:
pt_br: Especificar o pacote onde as interfaces de cliente do serviço web (e stubs, se aplicável) será gerada:

source: WSDL URL is not valid
pt_br: URL WSDL URL não é válida

source: Refreshing wsdl...
pt_br: Atualizando wsdl...

source: Wsdl file has changed, replace local version?
pt_br: Arquivo Wsdl foi alterado, substituir a versão local?

source: Updating wsdl file...
pt_br: Atualizando arquivo wsdl...

source: Update finished, wsdl file is unchanged.
pt_br: Atualização finalizada, arquivo wsdl mantem-se inalterado.

source: Wsdl file has changed.
pt_br: Arquivo wsdl foi modificado.

source: Stopping download...
pt_br: Parando a baixa...

source: Floating point
pt_br: Ponto flutuante

source: Convert floating point to String
pt_br: Converte ponto flutuante para String

source: Generate DataBinding structures
pt_br: Gerar struturas dataBinding

source: WSDL URL:
pt_br: URL WSDL:

source: Refresh WSDL
pt_br: Atualizar WSDL

source: Client name:
pt_br: Nome do cliente:

source: Project name is not valid
pt_br: Nome do projeto não é válido

source: Client name is not valid
pt_br: Nome do cliente não é válido

source: Synchronous
pt_br: Síncrono

source: Generate stubs
pt_br: Gerar stubs

source: Communication protocol:
pt_br: Protocolo de comunicação:

source: Exported services:
pt_br: Serviços exportados:

source: Update
pt_br: Atualizar

source: Servlet name:
pt_br: Nome do servlet:

source: Create sample MIDlet
pt_br: Criar amostra MIDlet

source: Services:
pt_br: Serviços:

source: Please wait, computing services...
pt_br: Aguarde, computando serviços...

source: ActiveSync Library Wrapper Module
pt_br: Biblioteca do módulo wrapper ActiveSync
